{
  "name": "Mekanism",
  "description": "Mekanism - это мод, на который Вы перейдете после Immersive Engineering. Он поможет Вам в обработке красной и синей стали, автоматизирует добычу и значительно увеличит выход металла. Механика этого мода не претерпела значительных изменений, но рецепты были изменены в соответствии с прогрессом модпака. Изменения, которые мы сделали, в основном касаются обработки TFC типов руд, распознавания TFC температур, использования машин для некоторой автоматизации TFC предметов. А еще, мы добавили Электрический холодильник.",
  "quests": [
    {
      "name": "Металлургич. наполнитель",
      "description": "Последний уровень.",
      "x": 237,
      "y": 16,
      "icon": {
        "id": "Mekanism:MachineBlock2",
        "damage": 2
      },
      "prerequisites": [
        "Конфигурация"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Ультимативное произв. стали",
          "longDescription": "Металлургический наполнитель позволяет получить еще один способ производства стали. Он также необходим для изготовления других компонентов из этого мода.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 8
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Камера очистки",
      "description": "До блеска.",
      "x": 279,
      "y": 42,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 9
      },
      "prerequisites": [
        "Металлургич. наполнитель"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Создайте и очищайте",
          "longDescription": "Камера очистки позволяет обрабатывать цветную сталь. Вы можете очистить пыль Высокоуглеродистой цветной стали (High Carbon) в амальгаму (Amalgam), которая затем может быть выплавлена в доменной печи. Она также используется при обработке руды и кожи.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 9
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Осмиевый компрессор",
      "description": "Сверхплотный.",
      "x": 191,
      "y": 43,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 1
      },
      "prerequisites": [
        "Металлургич. наполнитель"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Универсальная сжималка",
          "longDescription": "Осмиевый компрессор используется для простых вещей и может изготавливать все пластины/слитки, и сваривать их вместе.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 1
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Петестановка на базе",
      "description": "Вам всегда было неохота этим заниматься.",
      "x": 30,
      "y": 183,
      "icon": {
        "id": "Mekanism:CardboardBox"
      },
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Бережная упаковка",
          "longDescription": "Эта, с виду обычная Картонная коробка, из мода Mekanism имеет очень полезное применение. С помощью нее Вы можете переносить накопленные на базе богатства из сундуков, ящиков, бочек и др. хранилищ. Это так называемые Tile Entities - блоки с данными, сюда же входят всякие инвентари, устройства и машины. Просто щелкните ПКМ коробкой в руках по блоку который хотите перенести и он упакуется в коробку. Сломайте ее (спец. инструмент не нужен) и переставьте куда нужно. Снять коробку на Shift+ПКМ. Из недостатков можно выделить, что ориентация блока по сторонам света запоминается. Мы сделали ее более дорогой в крафте и ограничили число использований, а также внесли мод Plant Mega Pack в черный список, т.к. он крашит игру при попытке поместить цветок в коробку. Тем не менее, будьте осторожны с тем, что хотите перенести. По очевидным причинам каждый блок мы не тестили.                                 Примечание переводчика: в ориг. инструкции говорилось, что можно подобрать только 4 блока типа \"Tile Entities\" и любое количество обычных (блоки, которые не обсчитываются игрой - это всякие кирпичи и природные блоки), но при тесте я этих ограничений не заметил.",
          "items": [
            {
              "item": {
                "id": "Mekanism:CardboardBox"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Цифровой шахтер",
      "description": "Это кульминация всей Вашей игры и финал путешествия.                                                                                      Как пользоваться:                              1. В интерфейсе Ц.Ш. зайдите в \"Настройка\" (Config).                         2. Установите радиус (Radi) до макс 32. Минимальная (Min) - 0, можно не трогать, т.к. это бэдрок и Максимальная (Max) высоты. Напоминание, что в TFC уровень моря поднят до 144 блока.                 3. Нажмите \"Новый фильтр\" (New filter), выберите \"Словарь руд\" (OreDict). Во внутриигровой Wiki (та, что на клавишу \"I\") есть раздел про нужные Вам руды, но т.к. у Вас сейчас открыт интерфейс Ц.Ш., то зайдите в папку сборки модпака, найдите там папку igwmod и в ней файл \"06. Словарь руд для Digital Miner.txt\" и от туда Вы будете копировать нужные руды и минералы (или даже все).                  4. Скопируйте, например, tfcCopper и вставьте его в поле ввода фильтра в Ц.Ш (где написано \"ключ: null\"). Справа есть маленькая кнопочка \"!\" - \"Требуется замена\" (require replace). Это для замены блоков добытой руды на этот блок. Вставьте справа в слот образец если надо.                                         5. Если Вы хотите чтобы Ц.Ш. добывал все руды, то придется забить в фильтры все 30 руд из модпака. Каждая строчка словаря руд - новый фильтр.                           6. Обратите внимание, что в настройках Ц.Ш., где будет список Ваших фильтров в левом нижнем углу есть маленькая кнопочка \"I\" - \"Обратный режим\" (inverse mode). Она для изменения фильтров наоборот. Т.е., если Вы выбрали копать медь и включили эту опцию, то Ц.Ш. будет копать ВСЕ кроме меди.                                                     7. В главном интерфейсе Ц.Ш. в левом верхнем углу есть кнопка в виде четырех квадратов \"Визуальные\" (Visuals). После настроек фильтров и подачи энергии можно нажать ее. Это покажет область, которую будет обрабатывать Ц.Ш., но FPS может резко упасть.                                     8. Во внутренний буфер интерфейса Ц.Ш. будет помещать выкопанную руду, также он может из него же брать блоки для замены добытой руды, которые Вы настраивали в фильтрах.                                           9. Верхний желтовато-коричневый порт на Ц.Ш. используется для ввода предметов на замену рудным блокам. При включенной опции \"Собирать\" (Pull) он будет сам брать из прилегающего инвентаря к этому порту предметы.                   10. Задний порт - для добытой руды. В интерфейсе включите кнопку \"Извлечение\" (Eject) чтобы он сам выгружал руду. Если хранилище заполнится рудами, то Ц.Ш. продолжит есть энергию впустую, но добывать больше не будет.                                                11. Не забываем, что режим \"шелкового касания\" (Silk) не работает на блоках руды из TFC.     12. После настройки нажмите кнопку \"Запуск\" (Start). Вы увидите, сколько руды нашел Ц.Ш. и процесс ее добычи.                           13. Если Вы добавляли новые фильтры после того как Ц.Ш. уже работал какое-то время, то нажмите кнопку \"Сброс\" (Reset) чтобы он копал новые добавленные Вами руды.                                          14. К счастью Ц.Ш. запоминает все настройки и апгрейды в нем и его можно спокойно переносить в другое место. Не забудьте нажать кнопку Reset когда его переставите.",
      "x": 235,
      "y": 152,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 4
      },
      "prerequisites": [
        "Камера очистки",
        "Осмиевый компрессор"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Ваш Магнум опус",
          "longDescription": "Цифровой шахтер (Ц.Ш.) - это именно то, о чем Вы мечтаете. Он автоматически добывает все ресурсы, которые Вы хотите. Затрачивая при этом много энергии. Первое, что нужно знать, это то, что \"шелковое касание\" не работает с рудой TFC, но он будет добывать необработанный камень. Причина в том, что размещенные игроком природные блоки руды из TFC могут повредить игровой мир. Лучший способ выбрать руду, которую Вы хотите добыть - это использовать фильтр словаря руд. Нажмите в игре клавишу \"I\" и найдите 6-ой раздел в внутриигровой wiki чтобы узнать значения словаря руд для TFC (это текстовый файл, лежит в подпапке igwmod модпака).                                    Несколько особенностей Ц.Ш.: На заприваченой земле Ц.Ш. работать не будет. Как и другие устройства поддерживает апгрейды скорости и энергии (рекомендуется 8 каждого типа). Проявляйте осторожность с блоками и конструкциями из других модов, т.к. заранее поведение их сбора неизвестно. В лучшем случае Ц.Ш. просто уничтожит блок, машину или какой-нибудь алтарь. Также, он может обходить защитные системы модов таких как Thaumcraft и RFTools. Он не может собирать установленные блоки или пыль красного камня. Вы можете установить глубину и область сканирования. Можно заменить добытую руду блоками чтобы не оставлять пустоту. Ц.Ш. имеет два порта ввода-вывода (обозначены желтовато-коричневым квадратом) сверху и сзади. Верхний - для ввода блоков, которые будут заменять выкопанную руду (обычно, подают всякую ненужную коблу). Задний порт у Ц.Ш. для вывода выкопанной руды.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 4
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Инструменты из Mekanism",
      "description": "Множество интересных инструментов для работы с продвинутыми устройствами. Проверьте конфликт клавиш в настройках. По умолчанию режим работы инструментов переключается на Shift+M, а режим снаряжения на F и Shift+F (отключение реакт. ранца). Атомный разборщик переключается на Shift+ПКМ.",
      "x": 122,
      "y": 80,
      "icon": {
        "id": "Mekanism:AtomicDisassembler"
      },
      "prerequisites": [
        "Большие хранилища всякого",
        "Перемещаем разные вещи"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Водолазное снаряжение",
          "longDescription": "\"Противогаз\" - это вообще-то акваланг (GasMask). Особенно полезен для сбора песка и обсидиана под водой.",
          "items": [
            {
              "item": {
                "id": "Mekanism:GasMask"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Вам воздух или водород?",
          "longDescription": "Чтобы дольше оставаться под водой, Вам нужен на спине баллон с кислородом. Он также может быть заполнен водородом.",
          "items": [
            {
              "item": {
                "id": "Mekanism:ScubaTank"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Дискотека пламени",
          "longDescription": "Огнемет - это просто развлечение. У него есть 2 режима. Бой (Combat), который сжигает только существ, и Перегрев (Inferno), который поджигает все. Мы убрали режим Плавления (Smelting), так как он был очень несбалансированным. Режимы переключаются клавишами Shift+M. Проверьте конфликт клавиш.",
          "items": [
            {
              "item": {
                "id": "Mekanism:Flamethrower"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Супер акваланг",
          "longDescription": "Вы можете улучшить свой старый, чтобы работа под водой стала намного приятнее. Посмотрите рецепт в NEI.",
          "items": [
            {
              "item": {
                "id": "Mekanism:GasMask",
                "nbt": "{ench:[0:{lvl:2s,id:5s},1:{lvl:1s,id:6s}]}"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Мульти-инструмент",
          "longDescription": "Атомный разборщик (Atomic Disassembler) - это очень хороший инструмент. Это не только кирка, топор и лопата, он также имеет разные режимы работы (Shift+ПКМ). Имейте в виду, что режим работы \"Жила\" (vein) не очень удобен. По скорости он сравним с самой быстрой киркой с полным бонусом от кузнечного дела.",
          "items": [
            {
              "item": {
                "id": "Mekanism:AtomicDisassembler",
                "nbt": "{electricity:0.0d}"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Реакционная камера давления",
      "description": "Эра пластика.",
      "x": 177,
      "y": 110,
      "icon": {
        "id": "Mekanism:MachineBlock2",
        "damage": 10
      },
      "prerequisites": [
        "Осмиевый компрессор",
        "Камера очистки"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Хотите полетать?",
          "longDescription": "Одним из самых мощных предметов, которые можно получить в модпаке, является Дельтаплан (Hang Glider). В сочетании с реактивным ранцем он обладает огромным потенциалом для перемещения и путешествий. Чтобы получить дельтаплан, Вам понадобится пластик. Процесс производства пластика очень сложно описать текстом. Загляните в NEI. Найдите там предмет Polyethene.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock2",
                "damage": 10
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Удаление жидкости из машин",
          "longDescription": "Т.к. я долго ломал голову об этой проблеме, то решил, что должен передать эту информацию. Пипетка (Gauge Dropper) позволяет удалять жидкости из машин. Возможно, Вам пригодится это знание, когда будете работать с Реакционной камерой давления (Pressurized Reaction Chamber).        Примечание переводчика: в оригинале тут автор квестов забыл сделать условие получения пипетки, из-за чего этот квест было невозможно выполнить.",
          "items": [
            {
              "item": {
                "id": "Mekanism:GaugeDropper"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:Polyethene"
        }
      ]
    },
    {
      "name": "Охлаждеватель",
      "description": "Или просто холодильник.",
      "x": 294,
      "y": 113,
      "icon": {
        "id": "Mekanism:MachineBlock",
        "damage": 13
      },
      "prerequisites": [
        "Камера очистки",
        "Осмиевый компрессор"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Замораживаем продукты",
          "longDescription": "Мы добавили электрический холодильник-сундук. Он сохранит ваши продукты свежими и они не испортятся, пока Вы подаете ему энергию. Много энергии. Если она закончится, то продукты быстро сгниют. Сосуды с продуктами в холодильник помещать нельзя.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 13
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Взлетаем в небеса",
      "description": "Ну наконец-то!",
      "x": 19,
      "y": 82,
      "icon": {
        "id": "Mekanism:Jetpack",
        "nbt": "{stored:{amount:24000,gasName:\"hydrogen\"}}"
      },
      "prerequisites": [
        "Большие хранилища всякого",
        "Перемещаем разные вещи"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Что взлетает вверх...",
          "longDescription": "Реактивный ранец (Jetpack) работает так, как Вы и думаете. Возможность полета стоит вам слота нагрудной брони, а из-за измененной системы урона в TFC бронированная версия реактивного ранца (Armored Jetpack) бессмысленна. Да он и отключен. Переключение режимов на клавишу \"F\", а \"Shift+F\" - выключит ранец.",
          "items": [
            {
              "item": {
                "id": "Mekanism:Jetpack"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "То упадет вниз",
          "longDescription": "Урон от падения в TFC - это не шутки. Тут легко разбиться, если зазеваться. Если Вы решили полетать, то Вам действительно нужно это устройство. Это амортизированные бегунки, надеваются вместо ботинок. Но следите за зарядом, они быстро расходуют энергию.",
          "items": [
            {
              "item": {
                "id": "Mekanism:FreeRunners"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Лазерные лучи",
      "description": "Самое сложное - это поймать акулу (отсылка к мему Shark With Laser Beam).",
      "x": 75,
      "y": 176,
      "icon": {
        "id": "Mekanism:MachineBlock2",
        "damage": 13
      },
      "prerequisites": [
        "Большие батареи",
        "Гигантская кострюла воды"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Пиу-пиу-пиу!",
          "longDescription": "Высшее достижение в модпаке - запустить реактор Mekanism. Если описать весь процесс создания и работы реактора, то этот гайд будет весить больше, чем вся игра... Так что Youtube и Wiki - Ваши верные друзья. К тому же, у этого мода есть свой сайт, где удобно структурирована информация.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock2",
                "damage": 13
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Гигантская кострюла воды",
      "description": "Из которой выпаривают литий.",
      "x": 114,
      "y": 132,
      "icon": {
        "id": "Mekanism:BasicBlock",
        "damage": 14
      },
      "prerequisites": [
        "Модульные апгрейды"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Таких нужно будет много",
          "longDescription": "Термическая испарительная башня важна не только для увеличения добычи руды, но и для работы реактора. Она состоит из Контроллера (Evaporation Controller, главный блок), двух Вентилей (Evaporation Valve) для заливания воды и извлечения Brine (рапа) (это концентрированный соленнОй раствор) и Блока корпуса (Evaporation Block). На температуру башни влияет окружающая среда. Поэтому, возможно, стоит построить большой массив таких в пустыне. Это огромная мультиблочная структура 4x4x18 не закрытая сверху. На вершине которой срезаны по 1 блоку углов, а вместо них установлены Продвинутые солнечные панели (Advanced solar generator). Панели и срезанные углы не обязательны, но они дополнительно нагревают башню. Также, на стенку башни можно подавать дополнительный нагрев через трубы - Thermodynamic Conductor. Тепло можно создавать в Resistive Heater. Если сомневаетесь, то гляньте гайды как собрать такую башню.",
          "items": [
            {
              "item": {
                "id": "Mekanism:BasicBlock",
                "damage": 14
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Сейсмическая активность",
      "description": "Не привлекайте Шай-Хулуда...",
      "x": 125,
      "y": 181,
      "icon": {
        "id": "Mekanism:MachineBlock2",
        "damage": 9
      },
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Топот гиганта",
          "longDescription": "Это очень удобный механизм, о котором многие не знают. Поместите его в мир, дайте ему немного энергии и используйте Сейсмический считыватель (Seismic Reader), чтобы узнать подробную информацию о том, что у Вас под ногами. Он расскажет Вам о слоях породы вплоть до бэдрока. Определенно лучше, чем копать самому.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock2",
                "damage": 9
              }
            },
            {
              "item": {
                "id": "Mekanism:SeismicReader",
                "nbt": "{electricity:0.0d}"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Большие хранилища всякого",
      "description": "Храним большие объемы всякого полезного... и не очень.",
      "x": 18,
      "y": 36,
      "icon": {
        "id": "Mekanism:BasicBlock",
        "damage": 6,
        "nbt": "{tier:0}"
      },
      "prerequisites": [
        "Конфигурация"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Предметы",
          "longDescription": "По сути, каменная бочка. Может апгрейдиться несколько раз.",
          "items": [
            {
              "item": {
                "id": "Mekanism:BasicBlock",
                "damage": 6,
                "nbt": "{tier:0}"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Жидкости",
          "longDescription": "Портативный резервуар для жидкости. Также имеет \"Режим ведра\" (Shift+M), поэтому его крафт дороговат. Его можно проапгрейдить.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock2",
                "damage": 11,
                "nbt": "{tier:0}"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Энергия",
          "longDescription": "Энерго-кубы. Как большая батарейка. У них есть только один выходной порт, остальные - входные. При размещении порт выхода направлен на игрока. Можно проапгрейдить.",
          "items": [
            {
              "item": {
                "id": "Mekanism:EnergyCube",
                "nbt": "{tier:\"Basic\"}"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Газ",
          "longDescription": "Вам нужно будет хранить где-то газ. Этот баллон то, что Вам нужно. Можно проапгрейдить.",
          "items": [
            {
              "item": {
                "id": "Mekanism:GasTank",
                "nbt": "{tier:0}"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Плавящая фабрика",
          "longDescription": "Эти фабрики жарят несколько предметов одновременно как Индукционная печь из мода IC2. Могут быть проапгрейдены до 7 обрабатываемых предметов за раз. Некоторые машины в моде делятся на уровни. Данная машина начинается с \"Энергетическая плавильня\". Вы можете делать карты апгрейда \"Basic tier installer\", Advanced, Elite и Ultimate. Нажав Shift+ПКМ по машине картой Basic на \"Энергетической плавильне\" - она станет \"(Базовый) Плавящая фабрика\", затем можете дальше грейдить ее другими картами. Из-за разных названий машинок в этом моде, но с одинаковым функционалом может возникнуть путаница.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MachineBlock",
                "damage": 5,
                "nbt": "{recipeType:0}"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Перемещаем разные вещи",
      "description": "Классические трубы. Но стильные.                                                     Конфигуратор в режиме \"Предметы\" или \"Жидкость\" (переключать на Shift+M) может подключать трубы на вход или выход к хранилищам. Они сами по себе могут работать как \"Сервомеханизмы\" из Thermal expansion. Т.е. они сами забирают предметы и жидкость. Их нужно только настроить.",
      "x": 124,
      "y": 36,
      "icon": {
        "id": "Mekanism:PartTransmitter",
        "damage": 12
      },
      "prerequisites": [
        "Конфигурация"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Предметы",
          "longDescription": "В моде Mekanism есть множество труб для любых Ваших нужд. Их настройкой можно управлять с помощью Конфигуратора. Другая замечательная особенность труб этого мода в том, что Вы можете модернизировать их в разные уровни не снимая, просто щелкнув по ним ПКМ Сплавом следующего уровня. То есть, \"Базовый логистический транспортер\" переделывается в Продвинутый (см. NEI) и для его улучшения нужен \"Обогащенный сплав\". Этим сплавом кликните по установленной трубе. Трубы крафтятся по 8 шт, это значит, что одного Сплава хватит на апгрейд 8 секций трубы. Этот квест на предметные трубы.",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 12
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Утилитарные трубы",
          "longDescription": "Есть разные трубы для управления движением предметов.                       В \"Ограничительную\" (Restrictive) трубу подсоединенную к сундуку предметы будут попадать в самую последнюю очередь, если им уже некуда деваться. Можно использовать для мусорки, когда другие хранилища переполнятся.      \"Отклоняющая\" труба (Diversion) работает наоборот. Она принудит предметы отправлять в настроенную сторону, если в системе используется какая-то развилка. Возьмите Конфигуратор и настройте сторону этой трубы. Активен без сигнала - направление разрешено, когда нет редстоун сигнала. Запрещено с сигналом.                                             Активен по сигналу - направление запрещено, когда нет редстоун сигнала. Разрешено с сигналом. Всегда активен - игнорирует редстоун сигнал и пропускает предмет. Это состояние трубы по умолчанию.                                    Важная заметка для \"Отклоняющей\" трубы: заранее настройте поведение редстоун сигнала и только ПОТОМ подключайте к инвентарю или другой трубе. Иначе она не подключится. Рычагом управлять тоже нельзя. Труба запоминает только одно состояние в момент подключения к инвентарю или др. трубе. В общем, дело труба :D",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 16
              }
            },
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 17
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Жидкость",
          "longDescription": "Тут все должно быть понятно.",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 4
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Энергия",
          "longDescription": "Энергия течет по трубам...что за вздор!",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Газ",
          "longDescription": "Вероятно, газовые генератовы Вы очень полюбите. А для них нужны трубы.",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 8
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Теплообменники",
          "longDescription": "Эта \"труба\", которая передает тепло на \"Термическую испарительную башну\", которая важна не только для увеличения добычи руды, но и для работы реактора. Она состоит из Контроллера (Evaporation Controller, главный блок), двух Вентилей (Evaporation Valve) для заливания воды и извлечения Brine (рапа) (это концентрированный соленнОй раствор) и Блока корпуса (Evaporation Block). На температуру башни влияет окружающая среда. Поэтому, возможно, стоит построить большой массив таких в пустыне. Это огромная мультиблочная структура 4x4x18 не закрытая сверху. На вершине которой срезаны все углы по 1 блоку, а вместо них установлены \"Продвинутые солнечные панели\" (Advanced solar generator). Панели и срезанные углы не обязательны, но они дополнительно нагревают башню. Также, на стенку башни можно подавать дополнительный нагрев через \"Теплопровод\" (Thermodynamic Conductor). Тепло можно создавать в \"Устойчивый нагреватель\" (Resistive Heater). Если сомневаетесь, то гляньте гайды как собрать такую башню.",
          "items": [
            {
              "item": {
                "id": "Mekanism:PartTransmitter",
                "damage": 18
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:PartTransmitter",
          "damage": 13
        },
        {
          "id": "Mekanism:PartTransmitter",
          "damage": 5
        },
        {
          "id": "Mekanism:PartTransmitter",
          "damage": 9
        },
        {
          "id": "Mekanism:PartTransmitter",
          "damage": 1
        }
      ]
    },
    {
      "name": "Большие батареи",
      "description": "Очень большие.",
      "x": 35,
      "y": 129,
      "icon": {
        "id": "Mekanism:BasicBlock2",
        "damage": 3,
        "nbt": "{tier:0}"
      },
      "prerequisites": [
        "Модульные апгрейды"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Нужно мнооого таких ячеек",
          "longDescription": "Когда вы начнете производить очень много энергии, \"Энергетические кубы\" просто не справятся. Индукционная матрица (Induction Matrix) решит эту проблему. Она нужна для лазера. Это мультиблочная структура может быть почти любого размера. Вам нужны 3 вещи: Индукционный корпус (Induction Casing), Индукционный порт (Induction port) и индукционная ячейка (Induction Cell). Ячейки есть разного тира. Крафтите какие можете. Вам нужно установить вместе в любом количестве, ширины и высоты эти ячейки. Подойдут даже разного тира. Затем надо их окружить Индукционным корпусом и поставить 2 Индукционных порта в любое место (но не рядом друг с другом). Пустота внутри допускается. У Вас сформируется мультиблок, увидите красные частички анимации. Настройте Конфигуратором в режиме \"Энергия\" один порт для ввода энергии, а другой для вывода.",
          "items": [
            {
              "item": {
                "id": "Mekanism:BasicBlock2",
                "damage": 3,
                "nbt": "{tier:0}"
              }
            }
          ]
        }
      ]
    },
    {
      "name": "Модульные апгрейды",
      "description": "Найдено новое обновление. Найдено новое обновление. Найдено новое обновление.",
      "x": 72,
      "y": 95,
      "icon": {
        "id": "Mekanism:SpeedUpgrade"
      },
      "prerequisites": [
        "Большие хранилища всякого",
        "Перемещаем разные вещи"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Скорость имеет значение",
          "longDescription": "Многие машины из Mekanism могут быть модернизированы. Найдите в правом верхнем углу графического интерфейса кнопку \"Улучшения\" для добавления туда карт-улучшений. Там Вы узнаете, какие улучшения машина может принять и в каком количестве. Это ускоряет ее работу.",
          "items": [
            {
              "item": {
                "id": "Mekanism:SpeedUpgrade"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Больше энергии",
          "longDescription": "Увеличивает внутренний буфер машины.",
          "items": [
            {
              "item": {
                "id": "Mekanism:EnergyUpgrade"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Не очевидный апгрейд",
          "longDescription": "Улучшение для Электрической помпы (Electric Pump). Позволяет ей производить \"Тяжелую воду\" (Heavy Water), которая нужна будет для создания Дейтерия (Deuterium), который используется в термоядерном реакторе.",
          "items": [
            {
              "item": {
                "id": "Mekanism:FilterUpgrade"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Потише, пожалуйста",
          "longDescription": "Делает машины тише.",
          "items": [
            {
              "item": {
                "id": "Mekanism:MufflingUpgrade"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Экономим газ",
          "longDescription": "Снижает потребление газа в машинах, таких как \"Камера очистки\" (Purification Chamber) или \"Химическая инъекционная камера\" (Chemical Injection Chamber). Рекомендуется при  максимально длинной технологической цепочке обработки руд. В Mekanism есть условные 4 ступени для обработки руд на максимальный выход продукции.",
          "items": [
            {
              "item": {
                "id": "Mekanism:GasUpgrade"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "Mekanism:MufflingUpgrade"
        }
      ],
      "rewardchoice": [
        {
          "id": "Mekanism:SpeedUpgrade"
        },
        {
          "id": "Mekanism:EnergyUpgrade"
        },
        {
          "id": "Mekanism:FilterUpgrade"
        },
        {
          "id": "Mekanism:GasUpgrade"
        }
      ]
    },
    {
      "name": "Конфигурация",
      "description": "Я чувствую себя Доктором.",
      "x": 74,
      "y": 13,
      "icon": {
        "id": "Mekanism:Configurator",
        "nbt": "{electricity:60000.0d}"
      },
      "tasks": [
        {
          "type": "DETECT",
          "description": "Инструмент для настройки",
          "longDescription": "Поскольку этот предмет критически важен для управления некоторыми функциями труб и машинами, мы позволили ему заряжаться в сетке крафта бесплатно.",
          "items": [
            {
              "item": {
                "id": "Mekanism:Configurator",
                "nbt": "{electricity:60000.0d}"
              },
              "precision": "FUZZY"
            }
          ]
        }
      ]
    }
  ],
  "reputationBar": []
}