{
  "name": "Каменная эра",
  "description": "Эра, в которой Вам нужно сделать инструменты из камня. Вы научитесь основам выживания.",
  "quests": [
    {
      "name": "Встречаем Terrafirmacraft!",
      "description": "Где Вы узнаете, что изменилось в Minecraft.",
      "x": 25,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:Grass"
      },
      "tasks": [
        {
          "type": "DETECT",
          "description": "Собираем палки и камни",
          "longDescription": "TerraFirmaCraft (сокр. TFC) - это полная переделка привычных нам вещей в Minecraft. Первое, что Вы захотите сделать, чтобы выжить - это собрать палки и камни. Их можно найти в виде обломков на земле. Чтобы подобрать их, либо сломайте, либо нажмите правую кнопку мыши (ПКМ). Палки также можно собирать, обрывая листья на деревьях. В дальнейшем лучше всего делать это косой (Scythe) или ножницами (Shears). В этом модпаке TechNodeFirmaCraft (сокр. TNFC) палки и камни будут медленно респавниться. Это можно отключить в файле TFCConfig.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.stick"
              },
              "precision": "ORE_DICTIONARY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.LooseRock",
                "damage": 13
              },
              "required": 2,
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 5
        }
      ]
    },
    {
      "name": "Высечение",
      "description": "Основы работы с каменным инструментом.",
      "x": 63,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:item.LooseRock",
        "damage": 13
      },
      "prerequisites": [
        "Встречаем Terrafirmacraft!"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Камни в заготовки",
          "longDescription": "Чтобы начать обтесывать каменное орудие, необходимо минимум 2 камня. Держите камни в руке и щелкните правой кнопкой мыши, чтобы открыть интерфейс обтесывания. Щелкните по интерфейсу, чтобы удалить квадраты для формирования узора топора. Шаблоны для обтесывания доступны в NEI. Выделите камень курсором, нажмите U (клавиша по умолчанию).",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Axe Head"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Лесоповал",
          "longDescription": "Соедините головку каменного топора с палкой или костью в слоте для ремесла, чтобы создать свой первый каменный топор. В TFC, когда Вы ломаете дерево, оно падает все, а листья мгновенно опадают и не дают саженцев или палок. Поэтому не забудьте обкорнать крону, прежде чем рубить. Каменные топоры - ключевое оружие раннего периода. В TFC оружие наносит разные типы урона. Топор наносит косой урон (Slashing). Он эффективен против зомби и эндерменов.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Axe"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 16
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 12,
          "amount": 16
        },
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 19,
          "amount": 16
        }
      ]
    },
    {
      "name": "Гончарные изделия",
      "description": "Обучение лепке и обжигу изделий из глины.",
      "x": 186,
      "y": 12,
      "icon": {
        "id": "terrafirmacraft:item.Small Vessel",
        "damage": 1
      },
      "prerequisites": [
        "Подробнее о каменных орудиях"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Найдите залежи глины",
          "longDescription": "Чтобы найти залежи глины, ищите желтые цветы - Золотарник (Goldenrod), растущие на траве. Не стоит искать глину в местах с сухой травой (Dry Grass), так как для ее образования необходимо количество осадков выше 250. В меню F3 ищите строчку \"rain\". Там же можно узнать температуру биома (temp).",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Flora"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Clay"
              },
              "required": 5
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Небольшие гончар. изделия",
          "longDescription": "У Вас в руке должно быть не менее 5 штук глины, чтобы открыть графический интерфейс лепки, щелкнув ей ПКМ. Глина не будет расходоваться, пока Вы не выполните форму, поэтому если ошибетесь, просто закройте окно и попробуйте снова. Интерфейс работает так же, как и при обтесывании, а шаблоны можно найти в NEI.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Small Vessel"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Jug"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.ClayBowl"
              },
              "required": 2
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Большие гончар. изделия",
          "longDescription": "Как и раньше, просто сделайте большой сосуд из 5 глины. Данный сосуд используется как хранилище предметов или воды. Его можно надеть на спину как рюкзак (слот невидим, он правее нагрудника). Не забудьте запечатать перед поднятием.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Vessel"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Гончарная яма",
          "longDescription": "Гончарная яма делается глубиной в 1 блок. Для обжига в каждой яме требуется 8 соломы и 8 поленьев. Поместите необожженный глиняный предмет в ямку зажав Shift+ПКМ. Простой клик ПКМ пустой рукой заберет предмет из ямки. В ямку помещается до 4 маленьких предметов или 1 большой кувшин. После размещения заготовки в ямке на обжиг заполните ее 8 пучками сена и 8 бревнами. Зажгите огонь Огнивом (Firestarter), или бросьте факел на бревна. Через 8 игровых часов огонь прогорит и можно будет забрать готовые изделия. Их также можно положить на землю (Shift+ПКМ). Маленькие сосуды имеют множество применений. Во-первых, они расширяют ваш инвентарь. Если щелкнуть правой кнопкой мыши по маленькому сосуду, откроется инвентарь на 4 слота. Однако некоторые предметы слишком велики, чтобы поместиться туда. В первую очередь это касается стопок еды, которые должны быть не более 80 унций (еду можно разделить ножом). Маленькие сосуды ЗАМЕДЛЯЮТ СКОРОСТЬ РАСПАДА ПИЩИ В ДВА РАЗА и используются для выплавки меди или бронзы. Кувшины (Jug) используются для хранения пресной воды. Большие сосуды (Vessel) служат для хранения жидкостей или 9 предметов, их можно надеть на спину (слот незаметен, он правее слота нагрудника). Поставьте сосуд на землю и откройте инвентарь. Вкладки сверху для переключения между инвентарем предметов или жидкостей. Нажмите кнопку \"Запечатать\", чтобы сохранить предметы, когда Вы подбираете сосуд. Запечатанные большие сосуды тяжелые и должны быть размещены на спине. Также, они работают как ведро. Щелкнув ПКМ на блоке с жидкостью, Вы подберете жидкость и автоматически запечатаете ее. Незапечатанный пустой большой сосуд, поставленный на землю, будет собирать дождевую воду пригодную для питья.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jug",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Small Vessel",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:Vessel",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.ClayBowl",
                "damage": 1
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 16
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Jug",
          "damage": 1
        },
        {
          "id": "terrafirmacraft:item.Small Vessel",
          "damage": 1
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ]
    },
    {
      "name": "Подробнее о каменных орудиях",
      "description": "Где Вы узнаете об инструментах, добавленных TFC, которые Вам понадобятся для выживания.",
      "x": 98,
      "y": 11,
      "icon": {
        "id": "terrafirmacraft:item.IgIn Stone Axe"
      },
      "prerequisites": [
        "Высечение"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Каменное копье",
          "longDescription": "Копье (Javelin) - это дальнобойное оружие, которое можно использовать и в ближнем бою. Копье наносит колющий урон (piercing), который более эффективен против медведей, криперов, эндерменов и волков. Скелеты невосприимчивы к колющему урону, поэтому не стоит использовать копье против них.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Javelin"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Каменный нож",
          "longDescription": "Нож - это многоцелевой инструмент, который может срезать траву в солому, обрабатывать зерно, стричь овец, разделять пищу на мелкие кусочки, срезать гниль с пищи, а также использоваться в качестве колющего оружия (piercing) в крайнем случае.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Stone Knife"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Каменный молот",
          "longDescription": "Каменный молот в первую очередь используется для изготовления каменной наковальни, которая пригодится позже. Молот наносит дробящий урон (crushing), который наиболее эффективен против эндерменов и скелетов. Это единственное оружие каменного века, которое эффективно против скелетов. В TNFC молот также является ценным инструментом для строителя. Строительные блоки легко разбиваются, но не используйте его на блоках природного камня, земли, и т.п.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Stone Hammer"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.IgIn Stone Javelin Head",
          "amount": 4
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Stone Knife Blade"
        },
        {
          "id": "terrafirmacraft:item.Stone Hammer Head"
        }
      ]
    },
    {
      "name": "Еда и вода",
      "description": "Еда из дикой природы.",
      "x": 245,
      "y": 61,
      "bigicon": true,
      "icon": {
        "id": "minecraft:fish"
      },
      "prerequisites": [
        "Гончарные изделия"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Еда",
          "longDescription": "Еда - это постоянная проблема в TFC. В начале игры Вам придется исследовать местность, чтобы найти разный подножий корм. Посевы будут случайно появляться в мире, но они могут быть незрелыми, поэтому при сборе их Вы получите только семена. Вам нужно будет решить, есть ли у Вас время на создание фермы или вы хотите вернуться позже когда этот дикий урожай созреет. Вы найдете много диких животных, которые могут дать вам мясо. Помните, что ТОЛЬКО ОЛЕНИ И ФАЗАНЫ МОГУТ РЕСПАВНИТЬСЯ... медленно. Коровы, куры, свиньи, овцы и лошади будут появляться только во время генерации мира. Если Вы их убьете, то других не получите! Вы разделаете очень мало мяса от животных, пока не поднимете свой навык Разделка животных (Butchering). Поэтому в начале игры морские водоросли являются основным продуктом питания. Вы найдете водоросли на побережье в соленой воде. Для сбора их используйте нож, щелкая по ним ПКМ. Быстро объединить одинаковую еду можно клавишей \"S\" выделив ее курсором в инвентаре. Но чем дальше на север, тем реже вы будете их встречать. В TNFC водоросли медленно возрождаются. Это можно отключить в файле TFCConfig.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Sea Weed",
                "nbt": "{foodWeight:40.0f,foodDecay:-21.96039f,decayTimer:2294}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Питьевая вода",
          "longDescription": "Вам необходимо периодически пить. Вы можете пить из любого пруда, рек и ручьев, если в нем есть камыш. Щелкните ПКМ на пресной воде, убедитесь, что вы нацелились на блок под или рядом с блоком воды. Персонаж пьет медленно, но Вы можете носить воду в кувшине (Jug). С помощью кувшина можно быстро утолить жажду.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jug",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 8
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ]
    },
    {
      "name": "Понимание основ питания",
      "description": "Где подготавливаем Вашу ферму.",
      "x": 165,
      "y": 153,
      "icon": {
        "id": "terrafirmacraft:item.Carrot",
        "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
      },
      "prerequisites": [
        "Каменная мотыга"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Урожай",
          "longDescription": "Исследуя свой мир, вы будете находить все больше и больше еды. Ягодные кусты, фруктовые деревья и зерновые культуры. Зрелые культуры будут давать мешочки с семенами и предмет питания. Мешочек с семенами можно посадить на грядке, и он будет медленно расти в зависимости от множества факторов. Пища, которую приносят зрелые культуры, имеет вес и со временем гниет, в результате чего вес уменьшается. Для обработки пищи есть две клавиши быстрого доступа. Наведите курсор на любой продукт питания и нажмите \"D\", чтобы срезать гнилую часть. Наведите курсор на продукт и нажмите \"S\", чтобы сложить все продукты в стопки максимального размера. Гниение также можно обрезать, поместив еду в сетку ремесла с ножом. Если гниения нет, то стопка еды будет разделена пополам. Колосья зерновой культуры нужно перерабатывать ножом, получая зерна и солому. Лучше всего хранить эти зерна в маленьком кувшине, так как они медленнее разлагаются. Зерно можно использовать для кормления животных или переработать для приготовления хлеба. Чтобы выполнить этот квест, найдите любые семена.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Seeds Wheat"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Clay",
          "amount": 16
        }
      ]
    },
    {
      "name": "Костры",
      "description": "Где Вы научитесь примитивным способам приготовления пищи.",
      "x": 25,
      "y": 56,
      "icon": {
        "id": "terrafirmacraft:item.Firestarter"
      },
      "prerequisites": [
        "Встречаем Terrafirmacraft!"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Создание огня",
          "longDescription": "Первое, что Вам понадобится для создания костра, - это Огниво (Fire Starter). Сложите две палки в сетке крафта по диагонали.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Firestarter"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Временный свет",
          "longDescription": "Костер используется для изготовления факелов, приготовления пищи и другого. Он создается путем бросания 1 пучка соломы (срезайте ножом траву) и 3 палок на землю и поджигания этого блока щелчком правой кнопки мыши с помощью Огнива. Сформируется костер. Как только Вы создадите его, нужно будет заправить его поленьями или торфом, которые можно положить в левые слоты или бросить прямо на костер. Вам нужно будет защитить костер от дождя, иначе он погаснет. Предметы, которые вы хотите нагреть, помещаются в верхний слот и после завершения процесса опускаются в один из нижних слотов. Поместите палку, чтобы сделать 2 факела. Факелы - это первый источник света, но они перегорают со временем или тушатся от дождя и снега, а еще их могут тушить зомби. Вы можете вновь зажечь факелы, щелкнув ПКМ зажженным факелом на потухшем. Также, можно щелкнуть ПКМ палкой по факелу чтобы создать еще один факел, но только один из одной палки. Можно погасить факелы, щелкнув по ним ПКМ. Костры не поджигают блоки, но мы не советуем ходить по ним... Совет: на первых порах делайте \"Светильник Джека\" (Jack o\u0027Lantern). Это источник света, который не потухнет, но его не любят зомби...",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Torch"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Log",
          "amount": 4
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ]
    },
    {
      "name": "Кровать из шкуры",
      "description": "Не пригодна для сна, но всё же полезна.",
      "x": 76,
      "y": 61,
      "icon": {
        "id": "minecraft:bed"
      },
      "prerequisites": [
        "Подробнее о каменных орудиях"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Примитивная кровать",
          "longDescription": "Вы можете изготовить базовую кровать, положив БОЛЬШУЮ сырую шкуру на два блока соломы (щелкните ПКМ шкурой по соломе). Чтобы получить большую шкуру, Вам придется одолеть медведя или взрослую корову. Хотя Вы не сможете на ней спать, но она станет вашей точкой респауна.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Hide",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:Thatch"
              },
              "required": 2
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 13,
          "amount": 16
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ]
    },
    {
      "name": "В поисках металла",
      "description": "Где Вы научитесь собирать медь, чтобы сделать первые металлические инструменты.",
      "x": 265,
      "y": 11,
      "icon": {
        "id": "terrafirmacraft:item.Small Ore"
      },
      "prerequisites": [
        "Гончарные изделия"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Поиск самородков",
          "longDescription": "Чтобы покинуть каменный век, Вам нужно найти медную руду. Существует три типа руды, из которой при выплавке получается медь: Самородная медь (Native Copper), Малахит (Malachite) и Тетраэдрит (Tetrahedrite). Лучший способ получить самородки - исследовать. Помечайте места, где Вы их находите, так как рядом обычно будет большая рудная жила под землей. Позже вы сможете использовать Геологический Молоток (Prospector\u0027s Pick) для поиска самой жилы. В крайнем случае можно использовать Промывочную Миску (Gold Pan) или Рудопромывочный желоб (Sluice) (см. его сетап на Wiki), чтобы получить нужные Вам самородки. Для этого задания подойдет любой из трех типов меди. В TNFC самородки руды на поверхности медленно респавнятся. Это можно отключить в файле TFCConfig.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Small Ore"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Отчаяние",
          "longDescription": "Итак, Вам не повезло добыть достаточно меди для Вашего первого инструмента. Вы в отчаянии, но есть Промывочная Миска (Gold Pan). Поместите Керамическую Миску в решетку крафта, чтобы изготовить Промывочную Миску. Теперь, когда у вас есть такая, Вам нужно будет просеять песок или гравий под ПРОТОЧНОЙ водой, чтобы попытаться найти кусочки самородной руды. Для этого сначала щелкните ПКМ на блоке песка или гравия, чтобы наполнить миску. Затем щелкните ПКМ по ПРОТОЧНОЙ воде. Вы также можете найти кусочки самородной меди, золота, серебра или платины в зависимости от Вашего навыка Геолого-разведки (prospecting skill). Это не самое страшное занятие в первые несколько ночей в укрытии, но имейте в виду, что персонаж быстро будет уставать и захочет есть. Также, со временем чанк искусственно \"обеднеет\" (чтобы не халявили) или Вы сами устанете и бросите это дело.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.GoldPan"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.GoldPan"
        },
        {
          "id": "terrafirmacraft:item.Small Ore",
          "amount": 2
        }
      ]
    },
    {
      "name": "Каменная мотыга",
      "description": "Где Вы научитесь пользоваться новой мотыгой.",
      "x": 118,
      "y": 98,
      "icon": {
        "id": "terrafirmacraft:item.IgEx Stone Hoe"
      },
      "prerequisites": [
        "Подробнее о каменных орудиях"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Мотыги с доп. режимами",
          "longDescription": "Чтобы начать свою ферму, Вам понадобится мотыга. С помощью мотыги обрабатывайте траву, а не грязь, чтобы создать пашню, полную питательных веществ. В отличие от ванильной грядки, пашня TFC не нуждается в воде, но все же увлажненная пресной водой поможет урожаю расти быстрее. Каменная мотыга, используя клавишу смены режима (по умолчанию на \"M\"), также позволит вам проверить, увлажнена ли Ваша грядка и готовы ли растения на ней к сбору урожая. По мере того как Вы будете собирать больше урожая, Ваш навык Земледелия (Agriculture) будет повышаться. Что увеличит шанс получить дополнительные семена и откроет информацию о питательных веществах, необходимых для разных культур находящихся на грядках. Когда Ваш навык Земледелия достаточно высок, на мешках с семенами появится подсказка о том, какие питательные вещества необходимы той или иной культуре. Для просмотра дополнительной информации о грядках требуется достаточно высокий навык и металлическая мотыга. По мере роста культур они будут истощать питательные вещества земли, которые по умолчанию истощаются перед созреванием культуры. Но не волнуйтесь, со временем они будут постепенно восполняться, и культуры будут созревать. Поэтому разумно практиковать небольшой севооборот, чтобы Ваши культуры получали все необходимое для роста. Если Вы найдете Сильвит (Sylvite), вы можете сделать удобрение, которое увеличит количество питательных веществ в 2 раза по сравнению с обычным уровнем. Это гарантирует, что Ваши культуры не исчерпают питательные вещества до созревания.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.IgEx Stone Hoe"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Seeds Rye"
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Seeds Wheat"
        },
        {
          "id": "terrafirmacraft:item.Seeds Carrot"
        },
        {
          "id": "terrafirmacraft:item.Seeds Soybean"
        }
      ]
    },
    {
      "name": "Фруктовые деревья",
      "description": "Apple. Orange you glad I didn\u0027t say Banana?                                              (похоже, это какая-то отсылка к \"knock-knock joke\" 60-х годов)",
      "x": 121,
      "y": 154,
      "icon": {
        "id": "terrafirmacraft:fruitTreeSapling"
      },
      "prerequisites": [
        "Каменная мотыга"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Добываем саженцы",
          "longDescription": "Важным продуктом питания являются фрукты. Фруктовые деревья - один из двух источников фруктов в TFC. В отличие от обычных деревьев, вы получаете саженцы, ОТЛАМЫВАЯ БОКОВЫЕ ПОПЕРЕЧНЫЕ ВЕТВИ ТОПОРОМ ИЛИ ПИЛОЙ. Дерево продолжит расти. Если сломать ствол, то оно погибнет. В TNFC при посадке плодового дерева появляется саженец, а не сразу ствол плодового дерева. Со временем саженец сформирует ствол дерева и вырастет во взрослое дерево. В TNFC Вы также можете поместить саженцы фруктовых деревьев в цветочные горшки. Когда саженцы превратятся в ствол дерева, Вы не сможете забрать их обратно.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:fruitTreeSapling"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:fruitTreeSapling"
        },
        {
          "id": "terrafirmacraft:fruitTreeSapling",
          "damage": 6
        },
        {
          "id": "terrafirmacraft:fruitTreeSapling",
          "damage": 2
        },
        {
          "id": "terrafirmacraft:fruitTreeSapling",
          "damage": 7
        }
      ]
    },
    {
      "name": "Ягодные кусты",
      "description": "Декоративные и функциональные.",
      "x": 84,
      "y": 152,
      "icon": {
        "id": "terrafirmacraft:BerryBush",
        "damage": 3
      },
      "prerequisites": [
        "Каменная мотыга"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Найти ягодный куст",
          "longDescription": "Ягодные кусты можно найти по всему Вашему миру. Для их сбора не нужно какого-либо особого инструмента или хитрости, но их нужно сажать на траве. В TNFC ягодные кусты медленно респавнятся. Это можно отключить в файле TFCConfig. Это задание принимает любой ягодный куст.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:BerryBush",
                "damage": 1
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 1
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 2
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 3
        },
        {
          "id": "terrafirmacraft:BerryBush",
          "damage": 4
        }
      ]
    },
    {
      "name": "Салатики",
      "description": "Не выбрасывайте миски.",
      "x": 206,
      "y": 92,
      "icon": {
        "id": "terrafirmacraft:item.Salad",
        "nbt": "{foodWeight:0.0f,foodDecay:0.0f,FG:[-1,-1,-1,-1,],decayTimer:2164}"
      },
      "prerequisites": [
        "Гончарные изделия",
        "Каменная мотыга"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Салаты - это полезно",
          "longDescription": "Есть каждую категорию продуктов отдельно неэффективно. Употребляя салаты, Вы не только объединяете несколько пищевых групп, но и насыщаетесь и замедляете темпы снижения уровня пищевых групп, не входящих в салат. Чтобы приготовить салат, Вам нужна поверхность для готовки еды. Щелкните ПКМ по верхней части любого твердого блока с ножом, чтобы создать подобие разделочной доски. Войдите в графический интерфейс, чтобы приготовить салат. Вы можете использовать группу продуктов дважды, но каждый ингредиент должен быть уникальным. Салаты состоят из 20 унций еды.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Salad",
                "nbt": "{foodWeight:0.0f,foodDecay:0.0f,FG:[-1,-1,-1,-1,],decayTimer:2161}"
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.ClayBowl",
          "damage": 1,
          "amount": 4
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ]
    },
    {
      "name": "Животноводство",
      "description": "Люби меня.",
      "x": 197,
      "y": 178,
      "icon": {
        "id": "terrafirmacraft:item.Wheat Grain",
        "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
      },
      "prerequisites": [
        "Понимание основ питания"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Определитесь с культурой",
          "longDescription": "Животные не будут доверять Вам и не позволят к себе притронуться. Поэтому Вам нужно одомашнить их, если вы хотите получить драгоценную шерсть/молоко/транспорт. Запас зерна - хорошее начало. Но убедитесь, чтобы его хватило и на себя тоже.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wheat Whole",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "И вырастите зерно",
          "longDescription": "Вам нужно будет обработать собранные колосья злаков ножом, если только это не кукуруза. Теперь у Вас есть любимая еда ваших животных. Щелкните ПКМ подкравшись к животному, чтобы покормить его. Они будут есть только один раз в день, если только они не готовы к размножению. Если Вы хотите, чтобы они одомашнились, то не пропускайте ни одного дня. Когда значок сердца будет иметь белый контур (увидите при зажатой клавише Shift), их уровень одомашнивания больше не будет уменьшаться. Более подробно о привязанности и поколениях смотрите в официальной Wiki. Если вкратце, то каждое поколение будет более преданным и уровень привязанности будет заполняться все выше. Похоже, это единственный вариант полностью одомашнить волков.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wheat Grain",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Seeds Wheat"
        },
        {
          "id": "terrafirmacraft:item.Seeds Barley"
        },
        {
          "id": "terrafirmacraft:item.Seeds Rye"
        },
        {
          "id": "terrafirmacraft:item.Seeds Oat"
        }
      ]
    },
    {
      "name": "Прочнее чем в ванильном MC",
      "description": "Ну, почти.",
      "x": 201,
      "y": 133,
      "icon": {
        "id": "terrafirmacraft:item.Rope"
      },
      "prerequisites": [
        "Понимание основ питания"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Засейте плантацию",
          "longDescription": "Джут (Jute) - очень важная культура, хотя его нельзя есть. Зрелый джут достигает высоты двух блоков и имеет желтые цветки на верхушке. Совет: встречается в основном в теплых биомах. Ищите его, где практически не встречаются растения из мода Plant Mega Pack. Возможно, этот мод вытесняет собой спавн джута.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jute"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Замочите этот джут",
          "longDescription": "Теперь, когда у Вас есть джут, нужно замочить его в пресной воде. Это можно сделать в большом сосуде (Vessel) или бочке (Barrel). Вам понадобится 200mb на джут. Таким образом, 25 джута можно обработать в большом сосуде, а 50 - в полной бочке.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Jute Fibre"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Поводок. То есть веревка",
          "longDescription": "Пора смастерить эту драгоценную, драгоценную веревку. Не волнуйтесь, вы умеете завязывать узлы. Не нужно больше приклеивать поводок соплями к животным чтобы он отрывался каждых 10 метров...",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Rope"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Seeds Jute"
        }
      ]
    }
  ],
  "reputationBar": []
}