{
  "name": "Эра литья",
  "description": "Эра, когда вы научитесь отливать металлы в лучшие инструменты и освоите другие технологии, облегчающие выживание.",
  "quests": [
    {
      "name": "Выход из каменной эры",
      "description": "Здесь вы узнаете секреты основ металлургии.",
      "x": 22,
      "y": 14,
      "bigicon": true,
      "icon": {
        "id": "terrafirmacraft:item.Saw Mold"
      },
      "prerequisites": [
        "{Каменная эра}[В поисках металла]"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Больше никаких камней",
          "longDescription": "Настало время перейти к Эпохи Металлов. Самым важным металлом на начальном этапе является медь. Вы сделаете свои первые инструменты из меди или бронзового сплава. Вы найдете самородки металлов на земле, что указывает на наличие хотя бы одного блока руды в пределах 35 блоков в зоне 16x16 от самородка. Все отливки инструментов требуют 100 единиц металла для заполнения формочки. Таким образом, Вам понадобится 10 самородков. Вы можете сразу пропустить медные инструменты и изготовить их из бронзового сплава. Для этого задания подходит любой медный самородок.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Small Ore"
              },
              "required": 10,
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Формочки",
          "longDescription": "Глину можно использовать для изготовления слепков, которые используются для отливки медных и бронзовых инструментов. Вы также можете ковать медные и бронзовые инструменты на наковальне. Преимущество ковки инструментов заключается в том, что Вы повышаете свои навыки Кузнечного Дела (Smithing), которые добавляют процентный бонус ко всем выкованным инструментам. По достижении Железного века можно будет получить эксклюзивные инструменты.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Saw Mold"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.ProPick Mold"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Pick Mold"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Плавление руды в гончар. яме",
          "longDescription": "Итак, у вас достаточно самородков, чтобы изготовить по крайней мере один металлический инструмент. Каждый самородок стоит 10 единиц, а для заполнения одного слитка или формочки требуется 100 единиц. Поместите самородки в керамический сосуд и обожгите его (вместе с тремя формами под инструменты чтобы было экономней и быстрее, т.к. в ямку помещается 4 предмета). Рекомендуется как можно скорее сделать пилу. Если Вы делаете сплав, убедитесь, что у Вас правильные соотношения (используйте NEI). Если Ваши расчеты неверны, Вы просто получите свои самородки обратно. Когда огонь прогорит, выньте формочки и керамический сосуд с жидкой медью. Щелкните правой кнопкой мыши, чтобы открыть сосуд и поместить внутрь формочку. Когда она наполнится, извлеките ее, подождите пока остынет (если выплавляете слиток, то  поместите в бочку с водой), а затем положите в сетку для крафта, чтобы извлечь заготовку из формы (форма будет разрушена). Создайте полноценную пилу, соедините ее с палкой. Пила очень полезна на данном этапе, так как позволяет распиливать бревна на доски, которые используются для изготовления множества деревянных предметов или декора. Первым делом Вам нужно распилить бревно на 4 доски (получатся доски из TFC мода), из них делаются стандартные \"квадратные\" доски как ванильном Minecraft, и из них делается верстак. Сам верстак Вам не дадут, но это расширит вашу личную сетку крафта до 3х3. Для этого задания подходит любая пила. Примечание: в русской локализации есть \"доски\" из мода TFC и в ванильном MC тоже \"доски\", что может вызвать путаницу.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Saw"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 4
        },
        {
          "id": "terrafirmacraft:item.Log",
          "damage": 3,
          "amount": 4
        }
      ]
    },
    {
      "name": "Искусство горного дела",
      "description": "Здесь Вы узнаете о слоях горных пород, поиске залежей руды и добыче полезных ископаемых, не будучи раздавленными падающими блоками.",
      "x": 127,
      "y": 17,
      "icon": {
        "id": "terrafirmacraft:item.Copper Pick"
      },
      "prerequisites": [
        "Выход из каменной эры"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Инструменты горняка",
          "longDescription": "Мир TFC имеет 3 слоя горных пород, которые генерируются независимо друг от друга. Существует 21 тип горных пород, которые делятся на 4 категории. Осадочные (Sedimentary) - только верхний слой, метаморфические (Metamorphic) - верхний или средний слой, магматические интрузивные (Igneous Intrusive) - верхний, средний или нижний слой и магматические экструзивные (Igneous Extrusive) - все слои. Руды и минералы встречаются по всему миру как самородки на поверхности, так и в рудных жилах, но их местонахождение зависит от типа породы. Помните все те самородки, которые вы нашли? Надеюсь, Вы отметили их местоположение, так как именно там вам нужно искать рудные жилы. Если вы нажмете правой кнопкой мыши Геологическим Молотком по блоку, то он будет искать следы руды и минералов вокруг этой точки (область 25x25x25) и сообщит вам, сколько было найдено. Просто представьте себе куб, центр которого будет блок, по которому вы ударили. Инструмент может выдать ложные результаты с шансом 40% (похоже, навык Геолого-разведчика снижает шанс ошибки). Этот навык поиска руд крайне необходимо освоить, поэтому лучше всего почитать TFC Wiki или посмотрите видео на Youtube \"TFCWiki: Prospector\u0027s Pick\" от блогера Kittychanley. В этом задании принимаются кирки из любого металла.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Pick"
              },
              "precision": "ORE_DICTIONARY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Copper ProPick"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Предотвращение обвала",
          "longDescription": "Как Вы уже, наверное, заметили, на многие вещи влияет гравитация. Когда Вы добываете необработанный камень, есть вероятность, что Вы вызовете обрушение. Чтобы предотвратить обвалы, установите две Опоры (Support Beam) высотой не менее 3 блоков и соедините их хотя бы одной горизонтальной балкой. Это предотвратит обрушение на 1 уровень потолка и пола на 4 блока по горизонтали от горизонтальной балки. Вертикальные опоры не обеспечивают никакой поддержки. Даже если добываемый вами необработанный камень имеет опору, он все равно может привести к обрушению. Механика обвалов несколько сложна. Пожалуйста, посетите Wiki TFC для более подробного объяснения.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:WoodSupportV",
                "damage": 3
              },
              "required": 4,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:WoodSupportV",
          "damage": 3,
          "amount": 16
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Ore",
          "damage": 18,
          "amount": 8
        },
        {
          "id": "terrafirmacraft:WoodSupportV",
          "damage": 3,
          "amount": 16
        }
      ]
    },
    {
      "name": "Чудеса древесины",
      "description": "Где Вы научитесь пользоваться пилой, чтобы делать вещи из бревен.",
      "x": 25,
      "y": 101,
      "icon": {
        "id": "terrafirmacraft:Chest TFC",
        "damage": 3
      },
      "prerequisites": [
        "Выход из каменной эры"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Мастерим сундуки",
          "longDescription": "Теперь, когда у Вас есть пила, Вы наконец-то можете изготавливать сундуки. Эти сундуки немного отличаются от ванильных. Они меньше, и не все предметы можно в них поместить. Они изготавливаются из 8 TFC-досок одного типа. В этом задании принимаются сундуки из любого дерева.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Chest TFC",
                "damage": 3
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:Chest TFC",
          "damage": 3
        }
      ]
    },
    {
      "name": "Бронза",
      "description": "Здесь Вы научитесь делать полезные медные сплавы.",
      "x": 197,
      "y": 52,
      "icon": {
        "id": "terrafirmacraft:item.Bronze Ingot"
      },
      "prerequisites": [
        "Основы кузнечного дела"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Создание бронзы",
          "longDescription": "Из смеси меди и других металлов получается более прочный сплав. Сплавы имеют процентное содержание каждого металла. Существует 3 вида бронзового сплава: обычная, черная, висмутовая. Различия между ними незначительны, поэтому подойдет любая. Посмотрите соотношения смешивания в NEI. Любая бронза может быть изготовлена в гончарной печи в кувшине, также как Вы делали формочки, или в Тигле (Crucible), что удобнее. Для тигеля Вам нужна Кузница (см. квест \"Кузница\"), Огнеупорная глина (Fire clay), а для нее придется поискать Каолинит (Kaolinite) и Графит (Graphite). Совет: если выберите вариант с тигелем, то следите за температурой (F3). Если персонаж долго будет стоять возле него, то нагреется до 35 градусов и получит тепловой удар (может даже фатальный)! Для этого задания подойдет любой слиток бронзового сплава.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Bronze Ingot"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.Ore",
          "damage": 5,
          "amount": 8
        },
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ]
    },
    {
      "name": "Основы кузнечного дела",
      "description": "Где Вы научитесь делать наковальню.                                        (Как ковать предметы смотрите в квесте \"Улучшенное оружие\")",
      "x": 218,
      "y": 18,
      "icon": {
        "id": "terrafirmacraft:Anvil",
        "damage": 1
      },
      "prerequisites": [
        "Порошок флюса"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Изготов. медных слитков",
          "longDescription": "В отличие от инструментов, Вы не можете пропустить медную наковальню, но не волнуйтесь, со временем у вас появится технология, позволяющая вернуть весь металл, который Вы на нее потратили. Итак, создадим свою первую наковальню. Наковальня первого уровня изготавливается из необработанного магматического камня (Диорит, Андезит, Габбро, Базальт, Гранит, Дацит, Риолит). Вы можете сделать наковальню прямо на месте или унести камень к себе домой. Просто разбить его нельзя (выпадут осколки). Вам надо отколоть его от соседних прилегающих камней (чтобы нужный блок висел в воздухе), тогда он выпадет в мир и Вы его подберете. Щелкните правой кнопкой мыши на верхней части блока с молотом, чтобы сформировать наковальню. Левый нижний слот предназначен для молота, а правый нижний - для Флюса (Flux), который делается дроблением в порошок обломков камней. Сейчас нас интересует только кнопка \"Сварить\" (Weld). Чтобы сделать медную наковальню, Вам понадобится 14 слитков, которые нужно объединить в двойные слитки. Расплавьте медь в сосудах вместе с глиняными формами для слитков. Формы для слитков заполняются так же, как и формы для инструментов. В отличие от форм для инструментов, формы для слитков будут иметь температуру. Вам нужно будет подождать, пока металл затвердеет, чтобы извлечь его из формы. Вы получите свои формы обратно, но есть вероятность, что они сломаются. Не позволяйте горячим слиткам остывать слишком сильно, так как для Сварки (Weld) в двойные слитки они должны быть горячими (см. подсказку на слитке). Сваривать надо очень быстро, скорее всего с первого раза у Вас не получится. Если слитки сильно остынут, их надо нагреть в Кузнице (см. квест \"Кузница\"). В TNFC вы можете превратить слитки в металлические самородки с помощью зубила. Это поможет лучше посчитать пропорции металлов.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Ingot"
              },
              "required": 2,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Объединение слитков",
          "longDescription": "Пришло время сварить ваши горячие медные слитки в двойные слитки. Если Вы будете действовать очень быстро, слитки после извлечения из формочек будут еще достаточно горячими для сварки. Посмотрите на всплывающую подсказку температуры, чтобы понять, когда их можно будет сваривать. Чтобы сварить слитки в двойные, вам понадобится каменная наковальня, которую Вы делали ранее. Она способна сваривать только медные слитки. Поместите два слитка при температуре готовые к сварке в левые слоты и нажмите кнопку \"Сварить\" (Weld).",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Double Ingot"
              },
              "required": 7,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Создание медной наковальни",
          "longDescription": "Теперь все, что Вам нужно сделать, это изготовить наковальню. Только помните, что она тяжелая, поэтому, если Вы хотите носить ее с собой, она должна быть в слоте на спине. Металлы и сплавы разделены на уровни. Наковальни могут сваривать металлы/сплавы на один уровень выше своего материала и кузнечные изделия того же уровня, что и их материал. Так, медная наковальня может сваривать только медь и бронзу и может ковать только медные инструменты. Теперь, когда у вас есть медная наковальня, у вас есть технология изготовления бронзовой наковальни.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Anvil",
                "damage": 1
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Powder",
          "amount": 30
        }
      ]
    },
    {
      "name": "Кузница",
      "description": "Где Вы научитесь нагревать металл.",
      "x": 290,
      "y": 94,
      "icon": {
        "id": "Mekanism:BasicBlock",
        "damage": 3
      },
      "prerequisites": [
        "Угольные ямы"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Строительство кузницы",
          "longDescription": "Кузница - это мультиблочная структура. Ее наименьшая форма - это всего лишь 5 каменных блоков и либо 7 кусков древесного угля, либо 1 блок каменного угля. Сплошные блоки должны окружать кузницу со всех 4 сторон плюс дно (просто ямка обложенная со всех сторон камнем). Уголь размещается правой кнопкой мыши. Потом зажигайте его с помощью огнива (факел не подойдет). Как и костер, кузница будет потушена дождем. Также, она требует дымохода. Её можно использовать и без него, но только когда нет дождя. Вам нужно сделать подобие камина, но труба должна быть изогнута и уходить в небо. Над кузницей должен быть блок воздуха, а выше твердый блок. Позади неё тоже пустой блок, который перетекает в загнутую трубу (высота трубы не важна). Если сомневаетесь, то посмотрите Вики. В этом задании принимаются кирпичные блоки любой породы.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.coal",
                "damage": 1
              },
              "required": 7
            },
            {
              "item": {
                "id": "terrafirmacraft:StoneIgExBrick",
                "damage": 1
              },
              "required": 4,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:StoneIgExBrick",
          "damage": 1,
          "amount": 8
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.ItemStoneBrick",
          "damage": 12,
          "amount": 20
        },
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ]
    },
    {
      "name": "Бочки",
      "description": "Так много вариантов использования...                             (почему тут нет шутки про \"Do a barrel roll!\"?)",
      "x": 54,
      "y": 140,
      "icon": {
        "id": "terrafirmacraft:Barrel",
        "damage": 3
      },
      "prerequisites": [
        "Чудеса древесины"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Мастерим бочки",
          "longDescription": "Бочки используются для многих вещей. Они работают так же, как и большие сосуды (large vessel), только с большим количеством слотов. Их можно носить на спине как рюкзак. Некоторые крафты могут быть сделаны только в бочке. Бочки изготавливаются из 7 досок одной породы дерева, расположенных в виде буквы U. Это задание принимает любой тип бочки.                                          Совет: ОБЯЗАТЕЛЬНО посмотрите разные рецепты изготавливаемые в бочке. Там уйма всего. Зелья, саженцы и некоторые другие полезные предметы.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Barrel",
                "damage": 3
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:Barrel",
          "damage": 3
        }
      ]
    },
    {
      "name": "Изготовление хлеба",
      "description": "Мнем тесто.",
      "x": 80,
      "y": 99,
      "icon": {
        "id": "terrafirmacraft:item.Rye Bread",
        "nbt": "{foodWeight:57.6f,foodDecay:0.15591253f,Processing Tag:{Cooked:634.4706f,CookedProfile:[10,-15,-7,7,-3,],FuelProfile:[-15,12,0,0,0,]},decayTimer:2868}"
      },
      "prerequisites": [
        "Перемалыаем косточки",
        "Деревянное ведро"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Перемалываем зерно в муку",
          "longDescription": "С помощью жерновов Вы можете переработать зерно в муку. Чтобы это сделать, Вам нужны Нижний жернов (основа) и Верхний жернов (вставляется в интерфейс основы). Основа делается из гладкого камня, который отесывается зубилом. Внимание! У Вас на хотбаре должен быть вынесен еще и молот, а самим зубилом Вы обтесываете камень по ПКМ в режиме сглаживания. Верхний жернов (колесо) делается выбиванием киркой соседних природных блоков от центрального. Также как Вы делали каменную наковальню. Поместите его в интерфейс. Зерно тоже поместите в жернова и нажмите ПКМ на деревянную ручку (прицельтесь точно на ручку), чтобы повернуть мельничный камень. В этом задании можно использовать любой тип муки.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Rye Ground",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2227}"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Делаем тесто",
          "longDescription": "Теперь, когда у Вас есть мука, соедините ее с деревянным ведром наполненным пресной водой, чтобы сделать тесто. Для этого задания подходит любой вид теста.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Rye Dough",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2381}"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Выпекаем хлеб",
          "longDescription": "Теперь пришло время приготовить хлеб. Поместите тесто в костер. Когда хлеб будет приготовлен, он перейдет в нижний слот, но он будет продолжать готовиться здесь и в конце концов может сгореть. Для этого задания подходит любой вид хлеба.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Rye Bread",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2381}"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.MineralOre",
          "damage": 20,
          "amount": 8
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.MineralOre",
          "damage": 20,
          "amount": 8
        },
        {
          "id": "terrafirmacraft:item.Powder",
          "damage": 9,
          "amount": 16
        }
      ]
    },
    {
      "name": "Деревянное ведро",
      "description": "Набираем воду.",
      "x": 56,
      "y": 62,
      "icon": {
        "id": "terrafirmacraft:item.Wooden Bucket Empty"
      },
      "prerequisites": [
        "Выход из каменной эры"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Деревянное ведро",
          "longDescription": "Это простое решение для переноса холодных жидкостей, таких как вода, молоко и уксус. Хотя, Вы можете вылить воду на землю, но она быстро исчезнет, так как данное ведро не может поместить блоки-источники воды в мир. Потом Вы сможете переносить воду и лаву. Для этого будут специальные ведра.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wooden Bucket Empty"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Переносим пресную воду",
          "longDescription": "Вы можете использовать ведро, чтобы наполнить бочку пресной водой или сделать тесто из муки.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wooden Bucket Water"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Log",
          "damage": 3,
          "amount": 8
        }
      ]
    },
    {
      "name": "Перемалыаем косточки",
      "description": "Где Вы научитесь перемалывать не только муку.",
      "x": 126,
      "y": 100,
      "icon": {
        "id": "terrafirmacraft:Quern"
      },
      "prerequisites": [
        "Молот и зубило"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Похож на точильный камень",
          "longDescription": "Жернова - это каменный инструмент для ручного перемалывания самых разных материалов. Вам понадобятся основание и перемалывающий точильный камень, который помещается в интерфейс в самый верхний слот. Чтобы изготовить основание, нужно сгладить камень с помощью зубила (и молота, который должен быть на хотбаре). Для изготовления каменного колеса Вам нужно будет добыть каменные блоки. Для этого Вам нужно сломать камни вокруг центрального блока так, чтобы он повис в воздухе. Когда последний блок будет убран, он выпадет в виде изначального блока. Если вы все еще в замешательстве, то перечитайте еще раз квест \"Изготовление хлеба\". Либо посмотрите Wiki или Youtube.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Quern"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Quern"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ]
    },
    {
      "name": "Угольные ямы",
      "description": "Где Вы научитесь создавать древесный уголь.",
      "x": 242,
      "y": 116,
      "bigicon": true,
      "icon": {
        "id": "terrafirmacraft:item.coal",
        "damage": 1
      },
      "tasks": [
        {
          "type": "DETECT",
          "description": "Медленное горение",
          "longDescription": "Угольная яма обычно выкапывается в земле. Размер ее может быть любой. В нее нужно закладывать полные поленницы дров. Можно несколько слоев. Потом крыша закрывается кирпичами (желательно), которые не имеют гравитацию. Можно землей, но имейте ввиду, создание угля не будет 1:1 с единицами бревен, поэтому в яме могут образоваться пустые карманы и земля в них провалится. По механике TFC когда блок падает на жилу руды или уголь, то он собой уничтожает нижний блок. Т.е. земля уничтожит все под собой. Ещё хуже, если образуется дырка с доступом к воздуху, что приведет к полному сгоранию угля. Поэтому рекомендуется строить крышу из кирпичей, которые не подвержены гравитации. После заполнения ямы поленницами и создание крыши оставьте один блок пустым. Киньте туда факел и когда загорится огонь закройте оставшийся блок крышей. Все поленницы должны быть окружены не горючими блоками, без воздушных карманов. Вы увидите частицы дымы над крышей ямы когда она горит. Через 18 игровых часов можно будет собирать уголь лопатой.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.coal",
                "damage": 1
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Log",
          "amount": 16
        }
      ]
    },
    {
      "name": "Дубление шкур",
      "description": "Где Вы научитесь переделывать сырые шкуры в кожу.",
      "x": 29,
      "y": 170,
      "icon": {
        "id": "terrafirmacraft:item.TFC Leather"
      },
      "prerequisites": [
        "Бочки"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Сырые шкуры",
          "longDescription": "Существует три размера сыромятных шкур и зависят они от размера животного. Найдите по одной из них.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Hide"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Hide",
                "damage": 1
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Hide",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Вымачивание шкур",
          "longDescription": "Поместите большую шкуру в бочку или большой сосуд с \"известковым молоком\" (Limewater), которое делается из Флюса и запечатайте ее. Процесс превратит ее в вымоченную шкуру через несколько часов.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Soaked Hide",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Limewater"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Поскребите шкуры",
          "longDescription": "Теперь, когда Ваша шкура вымочена, Вам нужно положить ее сверху горизонтально расположенного блока бревна, щелкнув ей ПКМ по бревну. Затем, нужно соскоблить верхнюю часть шкуры ножом ПКМ. Когда шкура будет полностью выскоблена, щелкните ПКМ рукой и поднимите ее с бревна.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Scraped Hide",
                "damage": 2
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Промойте шкуры",
          "longDescription": "Следующий шаг - поместить выскобленную шкуру в бочку или большой сосуд с пресной водой на несколько часов и запечатать. Когда это будет сделано, Вы получите подготовленную шкуру. Пока Вы ждете, лучше всего приготовить еще бочку или большой сосуд с Танином. Поместите бревно Дуба (Oak), Березы (Birch), Каштана (Chestnut), Дугласовой пихты (Douglas Fir), Ореха (Hickory), Клена (Maple) или Секвойи (Sequoia) в бочку или большой сосуд с пресной водой и запечатайте его.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Prep Hide",
                "damage": 2
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Tannin"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Отмочите шкуры в танине",
          "longDescription": "Последний шаг - поместить подготовленную шкуру в танин на несколько часов и запечатать. После этого вы получите кожу. Вы можете обрабатывать кожу с помощью графического интерфейса, похожего на высечение на камне. Щелкните правой кнопкой мыши с куском кожи в руке и ножом на хотбаре, чтобы открыть графический интерфейс обработки.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.TFC Leather"
              },
              "required": 3
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.TFC Leather",
          "amount": 6
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ]
    },
    {
      "name": "Порошок флюса",
      "description": "Здесь Вы узнаете как его получить.",
      "x": 161,
      "y": 15,
      "bigicon": true,
      "icon": {
        "id": "terrafirmacraft:item.Powder"
      },
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Цемент и не только",
          "longDescription": "Порошок флюса используется для создания двойных слитков на наковальне, а также для \"известкового молока\" (Limewater) и далее в раствор для строительных кирпичей. Флюс изготавливается путем дробления молотком мела (chalk), доломита (dolomite), известняка (limestone), мрамора (marble) или боракса (borax). Известковое молоко (прим.: почему \"молоко\" я хз, когда это известковая вода) используется во многих ремеслах. Его получают из 2 флюсов на ведро пресной воды в большом сосуде или бочке.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Powder"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Powder",
          "amount": 32
        },
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 12,
          "amount": 5
        }
      ]
    },
    {
      "name": "Бутерброды",
      "description": "Лучшая еда на свете.                          Но не в реале. Сухомятка приводит к гастриту :) ",
      "x": 111,
      "y": 127,
      "icon": {
        "id": "terrafirmacraft:item.Sandwich",
        "damage": 3,
        "nbt": "{foodWeight:7.0f,foodDecay:0.017744305f,FG:[30026,2,10001,-1,-1,],tasteSalty:10,tasteBitter:22,decayTimer:2911,tasteUmami:81,tasteSour:6,decayRate:2.0f,tasteSweet:12,mealSkill:0}"
      },
      "prerequisites": [
        "Изготовление хлеба"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Займемся готовкой",
          "longDescription": "Как и салаты, Вы готовите бутерброды на поверхности для готовки еды. В верхней части интерфейса есть вкладка для переключения между приготовлением бутербродов и салатов. Поместите хлеб и другие ингредиенты в слоты для приготовления пищи и нажмите кнопку \"Создать\". Цифры над слотами показывают, сколько унций этого продукта будет в бутерброде. Минимальный его вес - 7 унций, максимальный - 10 унций. Как и в салатах, вы не можете повторять ингредиенты. Преимущество бутербродов в том, что они содержат все группы продуктов и могут быть съедены за один прием. В этом задании допускается любой бутерброд",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Sandwich",
                "damage": 3,
                "nbt": "{foodWeight:7.0f,foodDecay:-24.0f,FG:[30026,2,10001,-1,-1,],tasteSalty:10,tasteBitter:22,decayTimer:2886,tasteUmami:81,tasteSour:6,decayRate:2.0f,tasteSweet:12,mealSkill:0}"
              },
              "precision": "FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.MineralOre",
          "damage": 20,
          "amount": 8
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:item.LooseRock",
          "damage": 5,
          "amount": 4
        },
        {
          "id": "terrafirmacraft:item.MineralOre",
          "damage": 20,
          "amount": 8
        }
      ]
    },
    {
      "name": "Изготовление кирпичей",
      "description": "Где Вы научитесь делать кирпичи.",
      "x": 164,
      "y": 52,
      "icon": {
        "id": "terrafirmacraft:StoneIgExBrick",
        "damage": 1
      },
      "prerequisites": [
        "Молот и зубило",
        "Порошок флюса"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Кирпичи и раствор",
          "longDescription": "Кирпичи изготавливаются с помощью Зубила (chisel), камня и строительного раствора. Сначала вам нужно изготовить кирпичи. Поместите камни (осколки) в решетку для крафта с зубилом. Раствор изготавливается в бочке. Поместите песок в бочку с известковой водой (та, что \"молоко\" в русском переводе TFC) и запечатайте. Можно использовать Гипс (Gypsum) если найдете. Из каждой единицы песка и 100mb известковой воды получится 16 раствора. Вы можете вытащить несколько стопок из бочки. Сверяйтесь с NEI. Это задание можно выполнить с любым типом камня.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.ItemStoneBrick",
                "damage": 12
              },
              "required": 5,
              "precision": "ORE_DICTIONARY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Mortar"
              },
              "required": 4
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Кирпичные блоки",
          "longDescription": "На блоки из кирпичей не действует гравитация, поэтому они полезны для создания многоблочных конструкций и домов. Создайте кирпичный блок из 5 кирпичей и 4 кучек раствора. Для этого задания подойдут кирпичные блоки, сделанные из любого типа камня.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:StoneIgExBrick",
                "damage": 1
              },
              "required": 4,
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:StoneIgExBrick",
          "damage": 1,
          "amount": 4
        }
      ]
    },
    {
      "name": "Ковка брони",
      "description": "Где Вы научитесь ковать броню.",
      "x": 258,
      "y": 55,
      "icon": {
        "id": "terrafirmacraft:item.Copper Helmet"
      },
      "prerequisites": [
        "Основы кузнечного дела",
        "Кузница"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Металлические листы",
          "longDescription": "Для начала нужно обработать двойной слиток меди в металлический лист.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Sheet"
              },
              "required": 2,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Куем заготовку для шлема",
          "longDescription": "Теперь, когда у Вас есть медный лист, Вы можете сделать из него медный шлем. Это первый из трех этапов изготовления шлема.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Unfinished Helmet"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Добавляем еще металла",
          "longDescription": "Теперь, когда у Вас есть заготовка под шлем, нужно сварить ее с другим медным листом.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Unfinished Helmet",
                "damage": 1,
                "nbt": "{itemCraftingValue:0s}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Завершаем создание шлема",
          "longDescription": "Последний этап - это обработка его в готовый шлем на наковальне еще раз.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Helmet"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ]
    },
    {
      "name": "Улучшенное оружие",
      "description": "Где Вы узнаете, что лучшая защита - это нападение.                    Расширенное пояснение идеального крафта: Во-первых, каждый крафт будет разный для каждой карты и сервера. Единого \"рецепта\" на создаваемые вещи в наковальне нет. Но есть алгоритм, который позволит ковать предметы идеально точно. Итак, в интерфейсе наковальни есть красные и зеленые кнопки ударов с разными названиями. Все это скрытые цифры.                                   Красные кнопки: Слабый удар (-3), Средний удар (-6), Сильный удар (-9), Протянуть (-15).                       Зеленые кнопки: Штамповать (+2), Изогнуть (+7), Обжать (+13), Усадить (+16).                              Для начала возьмите холодный слиток и положите в наковальню, выберите что Вы хотите изготовить. Появится комбинация условий вверху по середине интерфейса. Сложите эту сумму и обратите ее в отрицательное значение (например, вышло 10, то будет -10 и наоборот). Иногда там может быть пустая ячейка (\"требуется выполнить любое действие\"). Сразу определитесь, что это будет за действие и всегда используйте его и в других крафтах. Теперь разогревайте слиток до состояния ковки, быстро кладите на наковальню, выбирайте свою заготовку и пока что любой комбинацией (лучше всего через \"Усадить\", т.к. быстрее) шлепайте до красной стрелки точно вровень. Затем, Вам нужно сделать сумму полученного отрицательного значения (из примера выше это было -10) из тех цифр, что у нас есть в наборе интерфейса наковальни.                              Пример: Сильный удар (-9), Слабый удар (-3), Штамповать (+2), что в сумме равняется -10. Выбиваете эти значения, а дальше выбиваете условие (то, что вверху по середине) СПРАВА НАЛЕВО. Стрелки должны идеально совпасть на последнем ударе и крафт завершится, а мастерство прокачается. Комбинации можете записывать куда-нибудь в блокнот чтобы быстро повторить тот же рецепт. Но помните, что они будут работать только для Вашей карты и на других серверах рецепты будут другими.",
      "x": 237,
      "y": 79,
      "icon": {
        "id": "terrafirmacraft:item.Copper Sword"
      },
      "prerequisites": [
        "Кузница",
        "Основы кузнечного дела"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Куем оружие",
          "longDescription": "Теперь, когда у Вас есть наковальня, Вы можете начать обрабатывать металл в оружие. Оружие, выкованное на наковальне, имеет бонусы к прочности и урону, зависящие от Вашего навыка кузнечного дела. Чтобы использовать наковальню, сначала нужно, чтобы металл был достаточно горячим для работы (смотрите на подсказку у слитка). Поместите раскаленный металл в первый центральный слот и нажмите кнопку \"План\" в виде свертка справа, чтобы открыть все возможные изделия из этого материала. Выбранная заготовка даст Вам условия, которые должны быть сделаны для последних 3 ударов в крафте. Заготовка будет завершена, когда 2 стрелки (красная и зеленая) идеально совпадают на последнем ударе. Если Вы переместите красную стрелку слишком далеко вправо, то потеряете свой металл. Мы рекомендуем посмотреть гайд от KittyChanley, чтобы лучше понять кузнечное дело. Для начала задания Вам понадобятся два двойных медных слитка и один обычный.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Ingot"
              },
              "precision": "NBT_FUZZY"
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Double Ingot"
              },
              "required": 2,
              "precision": "NBT_FUZZY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Меч. Тип урона - рубящий",
          "longDescription": "Меч - отличное оружие против полчищ зомби. Чтобы выковать его, вам нужно начать с двойного слитка. Обработайте его на наковальне, и у вас получится прекрасный меч. Мечи наносят рубящий урон (slashing). Для этого задания подойдет любой меч.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Sword"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Булава. Тип ур. - дробящий",
          "longDescription": "Булава - это оружие, наносящее дробящий урон (smashing). С булавой в руках вы теперь можете разбить этих надоедливых скелетов в пыль. Для этого задания подойдет любая булава.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Mace"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Копье. Тип ур. - колющий",
          "longDescription": "Копье из Каменного века проапгрейдилось. Металлические копья служат дольше и наносят больше урона. Это задание принимает ТОЛЬКО медные копья. Копья хороши против медведей, криперов, эндерменов и волков.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Javelin"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ]
    },
    {
      "name": "Молот и зубило",
      "description": "Где Вы научитесь обтесывать камень.",
      "x": 127,
      "y": 52,
      "icon": {
        "id": "terrafirmacraft:item.Copper Chisel"
      },
      "prerequisites": [
        "Искусство горного дела"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Зубило",
          "longDescription": "Зубило - полезный инструмент для обтесывания камня и изготовления кирпичей. Чтобы обтесать камень, Вам понадобится зубило в руке и молоток на хотбаре. Щелкните правой кнопкой мыши по необработанному камню с помощью зубила, и Вы сможете потом добыть его киркой. На сглаженные камни не действует гравитация. В TFC есть 4 режима работы зубила, для переключения между ними может потребоваться смена горячей клавиши (проверьте управление). По умолчанию это \"M\". Вы можете определить, в каком режиме Вы находитесь по иконке справа от Вашего хотбара. Режим \"Гладкий\" (белая пластина) сглаживает необработанный камень. Режим \"Лестница\" удаляет 1/8 блока за раз (можно делать ступеньки). Режим \"Плита\" (половина блока) позволяет отколоть от блока 1/8 куска (снимать тонкие слои). Режим \"Детализация\" (объемный квадрат) позволяет отколоть маленькие кусочки. Зубило предназначено не только для камня, им можно обрабатывать и другие блоки. Имейте в виду, что Вы не можете долбить любой необработанный камень, над которым есть 2 или более блока необработанного камня (иначе бы они упали). Мы добавили в сборку аддон TerrafirmaStuff, который добавляет дополнительные режимы выдалбливания, иконки которых слегка окрашены в синий цвет. Он добавляет режим \"Гладкий\", который работает только на терракотовых блоках (hardened clay). Также режимы этого мода работают на терракоте и Минеральных Блоках (Jet, Serpentine и Quartz). Режим \"Круг\" работает на блоках из камня и терракоте. И режим \"Столб\" (колонна) работает с камнем, терракоте и минеральными блоками. Для этого задания подходит любое зубило.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Copper Chisel"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:StoneIgEx",
          "damage": 2
        },
        {
          "id": "minecraft:experience_bottle",
          "amount": 4
        }
      ],
      "rewardchoice": [
        {
          "id": "terrafirmacraft:StoneIgEx",
          "damage": 1,
          "amount": 2
        },
        {
          "id": "terrafirmacraft:StoneSed",
          "amount": 2
        }
      ]
    },
    {
      "name": "Бронзовая наковальня",
      "description": "Здесь Вы узнаете больше о работе с наковальней.",
      "x": 196,
      "y": 99,
      "icon": {
        "id": "terrafirmacraft:Anvil",
        "damage": 2
      },
      "prerequisites": [
        "Бронза"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Металл получше",
          "longDescription": "Имея медную наковальню, вы теперь можете сваривать бронзовые слитки. Вам нужно будет сделать это в первую очередь, так как для того, чтобы сделать что-либо еще с бронзой, нужна бронзовая наковальня. Для ее изготовления все двойные слитки должны быть одного типа бронзы.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Bronze Double Ingot"
              },
              "required": 7,
              "precision": "ORE_DICTIONARY"
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Бронзовая наковальня",
          "longDescription": "Теперь Вы можете сделать бронзовую наковальню. С ее помощью можно обрабатывать бронзу для изготовления различных предметов. Вам нужно изготовить достаточное количество двойных листов бронзы для Домны (Bloomery), которая позволит вам перейти в железный век.                         Небольшая справка: Слово \"домна\" образовано от старославянского \"дмение\" - дутьё.                  Коренное отличие в значении слов \"домница\" и \"доменная печь\": в домнице получали куски восстановленного сыродутного железа - крица или же \"железная губка\" с неочищенным из него углем, т.е. шлак. А в доменной печи - жидкий чугун.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Anvil",
                "damage": 2
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Ore",
          "amount": 8
        }
      ]
    },
    {
      "name": "Коксовый уголь",
      "description": "Это топливо получше.",
      "x": 277,
      "y": 153,
      "icon": {
        "id": "terrafirmacraft:item.coal",
        "damage": 2
      },
      "prerequisites": [
        "Угольные ямы"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Добудьте каменный уголь",
          "longDescription": "Для некоторых металлов нужна очень высокая температура, чтобы они плавились и Вы могли с ними работать. Вам нужно найти лучшее топливо для Вашей кузницы. Вы знаете как сделать древесный уголь. Теперь сделайте то же самое, но с КАМЕННЫМ УГЛЕМ. Он устанавливается также как и бревна (Shift+ПКМ). Убедитесь, что все слоты в кучке заполнены по 16 единиц угля. Зажигайте, накрывайте и ждите когда все затухнет. Блоки разбивайте только МОЛОТОМ, т.к. другой инструмент уничтожит блок.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.coal",
                "damage": 2
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.coal",
          "damage": 2,
          "amount": 16
        }
      ]
    },
    {
      "name": "Самогон",
      "description": "Он может ослепить вас.",
      "x": 75,
      "y": 168,
      "icon": {
        "id": "terrafirmacraft:item.Whiskey"
      },
      "prerequisites": [
        "Бочки"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Вам понадобится бутылка",
          "longDescription": "А может и не одна...",
          "items": [
            {
              "item": {
                "id": "minecraft:glass_bottle"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Не забудьте змеевик...",
          "longDescription": "Создание алкоголя делается в бочке. Вам потребуется 4 унции на ведро чистой воды (а не от 4 до 12 как было ранее). Мы изменили это чтобы уменьшить путаницу. То есть 40 унций на бочку. Запечатайте бочку и оставьте это дело настаиваться пока не получите выпивку. Помните, если Вы не видите сообщения что будет в бочке на выходе, значит что-то не так. Когда алкоголь готов, просто щелкните ПКМ на открытой бочке бутылкой (пузырек \"пузырек\" в рус. локализации) или воспользуйтесь графическим интерфейсом. В сборке есть аддон TFC Scales - это весы. Сделайте грузики и поместите нужный вес на чашу весов (в поле 3 на 3) и нажмите Cut, но для этого у Вас в инвентаре должен быть нож. С их помощью легко делить продукты на точные порции.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Beer"
              },
              "precision": "ORE_DICTIONARY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:glass_bottle",
          "amount": 16
        }
      ]
    },
    {
      "name": "Уксус",
      "description": "Какая трата хорошей выпивки...",
      "x": 110,
      "y": 168,
      "icon": {
        "id": "terrafirmacraft:item.Vinegar"
      },
      "prerequisites": [
        "Самогон"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Ведро подойдет",
          "longDescription": "Чтобы сделать уксус, Вам придется испортить отличную бочку спиртного. Просто добавьте 10 унций фруктов на ведро спиртного. То есть 100 унций на бочку. Закупорьте и дайте настояться, пока не получится уксус. Наполните им ведро для выполнения задания.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Vinegar"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Vinegar"
        }
      ]
    },
    {
      "name": "Сыру, пожалуйста",
      "description": "Молоко есть?",
      "x": 142,
      "y": 146,
      "icon": {
        "id": "terrafirmacraft:item.Cheese",
        "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
      },
      "prerequisites": [
        "Уксус"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Серьезно. Есть молоко?",
          "longDescription": "Вам придется подружиться с коровой. Вы можете использовать до 9 ведер молока, чтобы сделать сыр. Просто залейте его в бочку. В TNFC вы также можете разливать молоко в бутылки.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wooden Bucket Milk",
                "nbt": "{foodWeight:20.0f,foodDecay:0.0f,decayTimer:2312}"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Bottle of Milk",
                "nbt": "{foodWeight:20.0f,foodDecay:0.0f,decayTimer:2312}"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Сыр",
          "longDescription": "Молоко есть, теперь нужно просто добавить ведро уксуса. Запечатайте бочку и дайте ему свернуться, а затем превратиться в сыр. Если вам хочется заморочиться с вкусовыми характеристики (не влияют ни на что, разве что ролеплей), Вы можете добавить продукты на стадии свернувшегося молока, чтобы изменить вкус сыра.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Cheese",
                "nbt": "{foodWeight:160.0f,foodDecay:-24.0f,decayTimer:2312}"
              },
              "precision": "NBT_FUZZY"
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "minecraft:experience_bottle",
          "amount": 8
        }
      ]
    },
    {
      "name": "Рассол",
      "description": "Консервация.",
      "x": 142,
      "y": 182,
      "icon": {
        "id": "terrafirmacraft:item.Brine"
      },
      "prerequisites": [
        "Уксус"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Девять к одному",
          "longDescription": "Просто смешайте 9 ведер соленой воды (морской) с 1 ведром уксуса, чтобы получить рассол. Рецепт мгновенный.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wooden Bucket Salt Water"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Vinegar"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "У меня нет времени",
          "longDescription": "Зачерпните рассол (Brine), чтобы выполнить это задание. Рассол - это первый шаг в консервировании продуктов. Сам по себе он бесполезен, но Вам нужно засолить продукты, чтобы потом мариновать и коптить их. Рассол можно использовать с любым типом продуктов, кроме зерновых. Чтобы засолить продукт, сначала убедитесь, что в бочке достаточно жидкости или разделите еду. Уксус можно использовать для маринования любых засоленных продуктов. Для маринования требуется 1000mb уксуса на каждые 16 унций засоленного продукта. На каждую унцию засоленного продукта, запечатанного в бочке с уксусом, будет расходоваться только 1mb уксуса. Замаринованные и запечатанные в бочке с уксусом продукты хранятся вечно.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Brine"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Vinegar"
        }
      ]
    },
    {
      "name": "Прялка",
      "description": "Для всех ваших ткацких нужд.",
      "x": 88,
      "y": 37,
      "icon": {
        "id": "terrafirmacraft:Loom"
      },
      "prerequisites": [
        "Выход из каменной эры"
      ],
      "tasks": [
        {
          "type": "DETECT",
          "description": "Делаем веретено",
          "longDescription": "Создайте заготовку веретена (Spindle) из палки и глины, а затем поместите ее в гончарную печь для обжига. Вы получите головку веретена, которую опять соедините с палкой, чтобы получить инструмент для обработки шерсти.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Spindle Head"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Spindle Head",
                "damage": 1
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.Spindle"
              }
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Получаем шерсть",
          "longDescription": "Есть два способа получить шерсть в TFC. Первый - подружиться с овцой настолько, чтобы она позволила вам стричь ее ножом или ножницами. Второй - соскрести овчину. Как только у вас будет шерсть, просто сделайте веретено (spingle), чтобы получить шерстяную пряжу.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.Wool"
              }
            },
            {
              "item": {
                "id": "terrafirmacraft:item.WoolYarn"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Плетение пряжи",
          "longDescription": "Простой рецепт крафта. Используемая порода дерева определяет текстуру прялки, но все они работают одинаково. Поместите его в мир, чтобы начать работу.",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:Loom"
              },
              "precision": "FUZZY"
            }
          ]
        },
        {
          "type": "DETECT",
          "description": "Шерсть или рогожа",
          "longDescription": "Чтобы сделать ткань, Вам нужно поместить шерстяную пряжу или нить на ткацкий станок и сплести ее. Щелкните правой кнопкой мыши по станку держа в руке 16 шерстяной нити или 24 обычной нити паука. Как только станок заполнится, Зажмите ПКМ с зажатым Shift чтобы начать ткать. WAILA покажет прогресс. После завершения щелкните правой кнопкой мыши, чтобы снять ткань. Из этой ткани можно изготовить блоки шерсти, которые можно снова превратить в ткань. Ткацкий станок также используется для изготовления Джутового полотна (burlap cloth).",
          "items": [
            {
              "item": {
                "id": "terrafirmacraft:item.WoolCloth"
              },
              "precision": "ORE_DICTIONARY"
            },
            {
              "item": {
                "id": "minecraft:wool"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.Wool"
        }
      ]
    },
    {
      "name": "Такая удобная",
      "description": "Наконец-то роскошь.",
      "x": 88,
      "y": 72,
      "icon": {
        "id": "minecraft:bed"
      },
      "prerequisites": [
        "Прялка"
      ],
      "tasks": [
        {
          "type": "CRAFT",
          "description": "Мы продолжим утром",
          "longDescription": "Просто используйте сотканную ткань и доски из TFC как в обычном рецепте кровати. Эта кровать позволит Вам провести ночь и установить тут свой спавн. Убедитесь, что Вы достаточно поели и попили перед сном, так как колонки еды и воды будут истощаться пока вы спите. Однако они будут расходоваться в два раза медленнее, чем обычно.",
          "items": [
            {
              "item": {
                "id": "minecraft:bed"
              }
            }
          ]
        },
        {
          "type": "CRAFT",
          "description": "Кровать с собой",
          "longDescription": "TFC - это мод про путешествия и исследования. Спальный мешок, позволяющий проспать всю ночь без сброса респауна, очень классный и полезный.",
          "items": [
            {
              "item": {
                "id": "OpenBlocks:sleepingBag"
              }
            }
          ]
        }
      ],
      "reward": [
        {
          "id": "terrafirmacraft:item.WoolCloth"
        }
      ]
    }
  ],
  "reputationBar": []
}